DataProcessors/Renault_РабочийСтолРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_РабочийСтолРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Блок учета продаж товаров и оказания услуг</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНормочасов</Name>
					<Comment>Количество нормочасов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого товар был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступленияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/CRM_ЗанятостьСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ЗанятостьСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_РабочийСтолРуководителя/Forms/Форма/Ext/Form/Module.bsl
Перем СписокДнейНеделиСокр;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Сегодня = Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy, dddd'");
	ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	НачалоРабочегоДня = Справочники.CRM_ДилерскиеЦентры.ПолучитьНачалоРабочегоДняАвтосервиса(ДилерскийЦентр,ТекущаяДата());
	КонецРабочегоДня = Справочники.CRM_ДилерскиеЦентры.ПолучитьКонецРабочегоДняАвтосервиса(ДилерскийЦентр,ТекущаяДата()); 
	
	ОбновитьИнтерфейсПользователя();
	
	ОбновитьВсеНаСервере(); 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Массив = Новый Массив;
	Массив.Добавить(Элементы.Logo);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив, "Картинка", "Логотип5");

	ВывестиЧасы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеНаСервере()
	ОбновитьПоказатели();
	
	ОбновитьМойОтдел();	
КонецПроцедуры

&НаСервере 
Процедура ОбновитьМойОтдел()
	
	ТаблицаМойОтдел.Очистить();
	
	Отдел = Renault_CRM.ПолучитьОтделСотрудника(ПараметрыСеанса.Пользователь.Сотрудник);
	
	Если НЕ ЗначениеЗаполнено(Отдел) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СписокСотрудников = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
	
	Если Не ЗначениеЗаполнено(СписокСотрудников) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтатусыСотрудников = Renault_CRM.ПолучитьСтатусыСотрудников(СписокСотрудников.ВыгрузитьЗначения());
	
	Для Каждого Сотр из СтатусыСотрудников Цикл
		
		НоваяСтрока = ТаблицаМойОтдел.Добавить();
		НоваяСтрока.Сотрудник = Сотр.Сотрудник;
		
		Если Сотр.АктивностьПользователя Тогда
			
			Если Сотр.ЗанятостьСотрудника = Перечисления.CRM_ЗанятостьСотрудника.Свободен Тогда
				
				НоваяСтрока.Статус = "Он-лайн, свободен";
				
			Иначе
				
				НоваяСтрока.Статус = "Он-лайн, занят: " + Строка(Сотр.ПричинаЗнаятостиСотрудника);
				
			КонецЕсли;
				
			
		Иначе
			
			НоваяСтрока.Статус = "Оффлайн";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсПользователя()
	СписокОтчетовПользователя = Renault_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РабочийСтолРуководителя_СписокОтчетовПользователя", , Новый СписокЗначений);
	
	Если СписокОтчетовПользователя.Количество() > 0 Тогда
		Для Каждого Эл Из СписокОтчетовПользователя Цикл
			ДобавитьОтчетНаСервере(Эл.Значение);
		КонецЦикла;
	КонецЕсли;
	
	СписокПоказателейПользователя = Renault_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РабочийСтолРуководителя_СписокПоказателейПользователя", , Новый СписокЗначений);
	
	Если СписокПоказателейПользователя.Количество() > 0 Тогда
		Для Каждого Эл Из СписокПоказателейПользователя Цикл
			ДобавитьПоказательНаСервере(Эл.Значение);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказатели()
	Для Каждого Эл Из СписокПоказателейПользователя Цикл
		ЭлЗначение = СтрокаВВерблюжьейНотации(Эл.Значение);
		ИмяРеквизита = ЭлЗначение + "Путь";

		ОбновитьПоказатель(ЭлЗначение, ИмяРеквизита);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказатель(ИмяЭлемента, ИмяРеквизита)
	Если ИмяЭлемента = "ЗагрузкаНаСегодня" Тогда
		ОбновитьПоказательЗагрузкиНаСегодня(ИмяРеквизита);
	ИначеЕсли ИмяЭлемента = "ЗагрузкаНаНеделю" Тогда
		ОбновитьПоказательЗагрузкиНаНеделю(ИмяРеквизита);
	ИначеЕсли ИмяЭлемента = "СреднийЧекПоВидамРемонта" Тогда
		ОпределитьПоказательСреднийЧекПоВидамРемонта(ИмяРеквизита);
	ИначеЕсли ИмяЭлемента = "НормочасыЗаЗаездПоВидамРемонта" Тогда
		ОпределитьПоказательСреднееКоличествоНормочасовЗаЗаездПоВидамРемонта(ИмяРеквизита);
	ИначеЕсли ИмяЭлемента = "СуммаПроданныхТоваровПоВидамРемонта" Тогда
		ОпределитьПоказательСуммаЗапчастейПоВидамРемонта(ИмяРеквизита);
	ИначеЕсли ИмяЭлемента = "КоличествоЗаездов" Тогда
		ОпределитьПоказательКоличествоЗаездов(ИмяРеквизита);
	ИначеЕсли ИмяЭлемента = "КоличествоНормочасов" Тогда
		ОпределитьПоказательКоличествоНормочасов(ИмяРеквизита);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьПоказатель(Команда)
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Загрузка на сегодня");
	СписокВыбора.Добавить("Загрузка на неделю");
	СписокВыбора.Добавить("Средний чек по видам ремонта");
	СписокВыбора.Добавить("Нормочасы за заезд по видам ремонта");
	СписокВыбора.Добавить("Сумма проданных товаров по видам ремонта");
	СписокВыбора.Добавить("Количество заездов");
	СписокВыбора.Добавить("Количество нормочасов");
	
	СписокВыборкаДляПользователя = Новый СписокЗначений;
	
	Добавлять = Истина;
	Для Каждого ЭлСписка Из СписокВыбора Цикл
		Для Каждого Показатель Из СписокПоказателейПользователя Цикл
			Если ЭлСписка.Значение = Показатель.Значение Тогда
				Добавлять = Ложь;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		Если Добавлять Тогда
			СписокВыборкаДляПользователя.Добавить(ЭлСписка.Значение);
			
			Продолжить;
		КонецЕсли;
		
		Добавлять = Истина;
	КонецЦикла;
	
	Если СписокВыборкаДляПользователя.Количество() = 0 Тогда
		Сообщить("Все показатели добавлены!");
	Иначе	
		Результат = ПоказатьФормуВыбора(СписокВыборкаДляПользователя);
		
		Ответ = ДобавитьПоказательНаСервере(Результат);
		
		Если ЗначениеЗаполнено(Ответ) Тогда		
			ПоказатьПредупреждение(, Ответ);
		Иначе
			Если ЗначениеЗаполнено(Результат) Тогда
				Если ТипЗнч(СписокПоказателейПользователя) = Тип("СписокЗначений") Тогда
					СписокПоказателейПользователя.Добавить(Результат);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьПоказательНаСервере(ИмяПоказателя)
	Перем Ответ;
	
	Если ЗначениеЗаполнено(ИмяПоказателя) Тогда
		ГруппаПоказателей = Элементы.ГруппаПоказатели;
		ИмяЭлемента = СтрокаВВерблюжьейНотации(ИмяПоказателя);
		ИмяРеквизита = ИмяЭлемента + "Путь";
		
		Ответ = СоздатьПоказатель(ИмяПоказателя, ИмяЭлемента, ИмяРеквизита, ГруппаПоказателей);
		
		Если ИмяПоказателя = "Загрузка на сегодня" Тогда
			ОбновитьПоказательЗагрузкиНаСегодня(ИмяРеквизита); 			
		ИначеЕсли ИмяПоказателя = "Загрузка на неделю" Тогда 			
			ОбновитьПоказательЗагрузкиНаНеделю(ИмяРеквизита); 			
		ИначеЕсли ИмяПоказателя = "Средний чек по видам ремонта" Тогда
			ОпределитьПоказательСреднийЧекПоВидамРемонта(ИмяРеквизита);
		ИначеЕсли ИмяПоказателя = "Нормочасы за заезд по видам ремонта" Тогда
			ОпределитьПоказательСреднееКоличествоНормочасовЗаЗаездПоВидамРемонта(ИмяРеквизита);	
		ИначеЕсли ИмяПоказателя = "Сумма проданных товаров по видам ремонта" Тогда
			ОпределитьПоказательСуммаЗапчастейПоВидамРемонта(ИмяРеквизита);		
		ИначеЕсли ИмяПоказателя = "Количество нормочасов" Тогда 			
			ОпределитьПоказательКоличествоНормочасов(ИмяРеквизита);
		ИначеЕсли ИмяПоказателя = "Количество заездов" Тогда 			
			ОпределитьПоказательКоличествоЗаездов(ИмяРеквизита);	
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

&НаСервере
Функция СоздатьПоказатель(ИмяПоказателя, ИмяЭлемента, ИмяРеквизита, ГруппаПоказателей)
	Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда				
		Возврат "Такой показатель уже есть";				
	КонецЕсли;
	
	ДобавитьКПанПоказателяИлиОтчета(ГруппаПоказателей, ИмяЭлемента);
	
	ДобавляемыеРеквизиты = Новый Массив();
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Диаграмма"));
    ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Показатель = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаПоказателей);
	Показатель.Вид = ВидПоляФормы.ПолеДиаграммы;
	Показатель.Заголовок = ИмяПоказателя;
	Показатель.ПутьКДанным = ИмяРеквизита;	
КонецФункции

&НаСервере
Процедура ДобавитьКПанПоказателяИлиОтчета(Родитель, Имя)	
	ИмяГруппы = "ГруппаКПан" + Строка(Имя); 
	
	НоваяКП = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	НоваяКП.Вид = ВидГруппыФормы.КоманднаяПанель;
	НоваяКП.Заголовок = "";
	
	КФУдалить = ЭтаФорма.Команды.Найти(Имя + "Удалить");
	
	Если КФУдалить = Неопределено Тогда		
		КФУдалить = ЭтаФорма.Команды.Добавить(Имя + "Удалить");
		КФУдалить.Действие = "КомандаКПанУдалить"; 		
	КонецЕсли;
	
	ИмяКнопки = "Удалить" + Строка(Имя);
	
	НоваяКН = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), НоваяКП);
	НоваяКН.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКН.Заголовок = "Удалить";
	НоваяКН.ИмяКоманды = Имя + "Удалить";
	
	Если Родитель.Имя = "ГруппаПоказатели" Тогда
    	КФОбновить = ЭтаФорма.Команды.Найти(Имя + "Обновить");

		Если КФОбновить = Неопределено Тогда			
			КФОбновить = ЭтаФорма.Команды.Добавить(Имя + "Обновить");
			КФОбновить.Действие = "КомандаКПанОбновить";			
		КонецЕсли;
		
		ИмяКнопки = "Обновить" + Строка(Имя);
		
		НоваяКН = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), НоваяКП);
		НоваяКН.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НоваяКН.Заголовок = "Обновить";
		НоваяКН.ИмяКоманды = Имя + "Обновить";	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказательЗагрузкиНаСегодня(ИмяРеквизита)
	
	ОбновитьДиаграммуЗагрузка(ИмяРеквизита, НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()), Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказательЗагрузкиНаНеделю(ИмяРеквизита)
	
	ОбновитьДиаграммуЗагрузка(ИмяРеквизита, НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКПанОбновить(Команда)
	ИмяКоманды = Команда.Имя;
	
	ДлинаСтрокиКонцовка = СтрДлина("Обновить");
	ДлинаСтроки = СтрДлина(ИмяКоманды);
	
	ИмяЭлемента = Лев(Команда.Имя, ДлинаСтроки - ДлинаСтрокиКонцовка);	
	ИмяРеквизита = ИмяЭлемента + "Путь";
	
	ОбновитьПоказатель(ИмяЭлемента, ИмяРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКПанУдалить(Команда)
	ИмяКоманды = Команда.Имя;
	
	ДлинаСтрокиКонцовка = СтрДлина("Удалить");
	ДлинаСтроки = СтрДлина(ИмяКоманды);
	
	ИмяЭлемента = Лев(Команда.Имя, ДлинаСтроки - ДлинаСтрокиКонцовка);
		
	УдалитьОтчетИлиПоказатель(ИмяЭлемента); 		
КонецПроцедуры

&НаСервере
Процедура УдалитьОтчетИлиПоказатель(ИмяЭлемента)
	ЗначениеОтчета = СписокОтчетовПользователя.НайтиПоЗначению(СтрокаБезВерблюжьейНотации(ИмяЭлемента));
	Если ЗначениеОтчета <> Неопределено Тогда
		УдалитьОтчет(ИмяЭлемента);
		
		СписокОтчетовПользователя.Удалить(ЗначениеОтчета);
	КонецЕсли;	
	
	ЗначениеПоказателя = СписокПоказателейПользователя.НайтиПоЗначению(СтрокаБезВерблюжьейНотации(ИмяЭлемента));
	Если ЗначениеПоказателя <> Неопределено Тогда
		УдалитьПоказатель(ИмяЭлемента);
		
		Для Каждого Эл Из СписокПоказателейПользователя Цикл
			Если Эл.Значение = ЗначениеПоказателя.Значение Тогда
				СписокПоказателейПользователя.Удалить(Эл);
				Прервать;
			КонецЕсли;			
		КонецЦикла; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьОтчет(ИмяЭлемента)
	КомандаОтчета = Команды.Найти(ИмяЭлемента);
	Команды.Удалить(КомандаОтчета);
	
	КнопкаОтчета = Элементы.Найти(ИмяЭлемента); 	
	Элементы.Удалить(КнопкаОтчета);
	
	КомандаУдалить = Команды.Найти(ИмяЭлемента + "Удалить");
	Команды.Удалить(КомандаУдалить);
	
	КнопкаУдалить = Элементы.Найти("Удалить" + ИмяЭлемента);
	Элементы.Удалить(КнопкаУдалить);
	
	Группа = Элементы.Найти("ГруппаКПан" + ИмяЭлемента);
	Элементы.Удалить(Группа);
КонецПроцедуры

&НаСервере
Процедура УдалитьПоказатель(ИмяЭлемента)
	//Диаграмма
	Показатель = Элементы.Найти(ИмяЭлемента); 	
	Элементы.Удалить(Показатель);	
	
	УдаляемыеРеквизиты = Новый Массив;	
	ИмяРеквизита = ИмяЭлемента + "Путь"; 
	
	УдаляемыеРеквизиты.Добавить(ИмяРеквизита);	
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	//Кнопка "Удалить"
	КомандаУдалить = Команды.Найти(ИмяЭлемента + "Удалить");
	Команды.Удалить(КомандаУдалить);
	
	КнопкаУдалить = Элементы.Найти("Удалить" + ИмяЭлемента);
	Элементы.Удалить(КнопкаУдалить);
	
	//Кнопка "Обновить"
	КомандаОбновить = Команды.Найти(ИмяЭлемента + "Обновить");
	Команды.Удалить(КомандаОбновить);
	
	КнопкаОбновить = Элементы.Найти("Обновить" + ИмяЭлемента);
	Элементы.Удалить(КнопкаОбновить);
	
	//Группа
	Группа = Элементы.Найти("ГруппаКПан" + ИмяЭлемента);
	Элементы.Удалить(Группа);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	Перем Форма;
	
	ИмяКоманды = Команда.Имя;

	Если ИмяКоманды = "Исполнители" ИЛИ 
		ИмяКоманды = "ЭффективностьЦеха" ИЛИ
		ИмяКоманды = "УчетНерабочегоВремени" ИЛИ
		ИмяКоманды = "УчетВремени" ИЛИ
		ИмяКоманды = "ПрочаяЗанятость" ИЛИ
		ИмяКоманды = "ОтчетПоСреднемуЧеку" ИЛИ
		ИмяКоманды = "ОтчетПоСертификатамКонтроля" ИЛИ
		ИмяКоманды = "ОтчетПоЗаездам" ИЛИ
		ИмяКоманды = "КонверсияОбращений"  ИЛИ
		ИмяКоманды = "ИспользованиеDMS" ИЛИ
		ИмяКоманды = "ТО" Тогда
		
		Форма = Отчеты["Renault_АвтосервисОтчетность_" + ИмяКоманды].ПолучитьФорму("ФормаОтчета");
		
	КонецЕсли;	
	
	Если Форма <> Неопределено Тогда
		Форма.СпособОтображенияОкна = ВариантСпособаОтображенияОкна.Максимизированное;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ОбновитьДиаграммуЗагрузка(ИмяРеквизита, НачалоПериода, КонецПериода, НаТекущийДень = Истина)
	
	//Если НаТекущийДень Тогда
	
	//Если НаТекущийДень Тогда
	
		Текущий_НачалоРабочегоДня = НачалоРабочегоДня;
		Текущий_КонецРабочегоДня = КонецРабочегоДня;
	
	//КонецЕсли;
	
	Текущий_ТекущийРабочийДень = ТекущаяДата();
	
	НачалоПериода = НачалоДня(ТекущаяДата());
	
	Если НЕ НаТекущийДень Тогда
	
		КонецПериода = КонецДня(НачалоПериода + 12 * 24 * 60 * 60);
	
	КонецЕсли;
	
	Значения = Новый ТаблицаЗначений;
	МаксимальнаяТочка = 0;
	
	Значения =  Renault_АвтосервисПланирование.ПолучитьТаблицуЗанятостиИМаксимальнуюТочку(МаксимальнаяТочка, 
	Текущий_ТекущийРабочийДень, ДилерскийЦентр, Текущий_НачалоРабочегоДня, Текущий_КонецРабочегоДня, Ложь,
	Ложь,Справочники.Цеха.ПустаяСсылка(),Перечисления.CRM_ВидыМашиноместВЦеху.ПустаяСсылка(),Справочники.Сотрудники.ПустаяСсылка());
	
	Диаграмма = ЭтаФорма[ИмяРеквизита];					
	
	Если Диаграмма = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
			
	Диаграмма.Очистить();
	
	Диаграмма.АвтоМаксимальноеЗначение = Ложь;
	
	Если НаТекущийДень Тогда
		
		Диаграмма.МаксимальноеЗначение = 95;
		
	Иначе
		
		Диаграмма.МаксимальноеЗначение = МаксимальнаяТочка;
		
	КонецЕсли;
	
	Если НаТекущийДень Тогда
		
		СерияЗагрузка = Диаграмма.Серии.Добавить(Строка(Сегодня));
		СерияЗагрузка.Цвет = новый Цвет(255,182,0);
		
	Иначе
		
		СерияЗагрузка = Диаграмма.Серии.Добавить("Загрузка с " + Формат(НачалоПериода, "ДФ=дд.ММММ") + " по " + Формат(КонецПериода, "ДФ=дд.ММММ"));
		СерияЗагрузка.Цвет = новый Цвет(255,182,0);
		
	КонецЕсли;
	
	Индекс = НачалоПериода;
	
	Пока Индекс <= КонецПериода Цикл
		
		Поиск = Значения.Найти(Индекс, "ДеньМесяца");
		
		Если Поиск = Неопределено Тогда
			
			Значение = 0;
			
		Иначе
			
			Значение = Поиск.Длительность;
			
		КонецЕсли;
		
		Значение = 100* Значение/?(МаксимальнаяТочка <> 0, МаксимальнаяТочка, 1);
		
		НоваяТочка = Диаграмма.Точки.Добавить(Строка(СписокДнейНеделиСокр[ДеньНедели(Индекс)-1])+ " " + Формат(Индекс, "ДФ=dd.MM.yy"));
		Диаграмма.УстановитьЗначение(НоваяТочка, СерияЗагрузка, Значение, Строка(Значение));
		
		Индекс = Индекс+24*60*60;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПоказатьФормуВыбора(СписокВыбора)	
	Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой", Заголовок = "Выбор");
	Форма.Заголовок = Заголовок;
	Форма.СписокВыбора = СписокВыбора;
	Ответ = Форма.ОткрытьМодально();
	Если НЕ ЗначениеЗаполнено(Ответ) Тогда
		Предупреждение("Необходим выбор элемента");
		Возврат Неопределено;
	КонецЕсли;

	Возврат Ответ; 	
КонецФункции

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	ОбновитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВывестиЧасы()
	
	Часы = Обработки.Renault_РабочийСтолРуководителя.ПолучитьМакет("Макет").ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасыДокументСформирован(Элемент)
	
	Элемент.Документ.Body.Scroll = "No";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтчет(Команда)	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Анализ первичных заездов");
	СписокВыбора.Добавить("Исполнители");
	СписокВыбора.Добавить("Эффективность цеха");
	СписокВыбора.Добавить("Учет нерабочего времени");
	СписокВыбора.Добавить("Учет времени");
	СписокВыбора.Добавить("Прочая занятость");
	СписокВыбора.Добавить("Отчет по среднему чеку");
	СписокВыбора.Добавить("Отчет по сертификатам контроля");
	СписокВыбора.Добавить("Отчет по заездам");
	СписокВыбора.Добавить("Конверсия обращений");
	СписокВыбора.Добавить("Использование DMS");
	СписокВыбора.Добавить("ТО", "ТО");
	
	СписокВыборкаДляПользователя = Новый СписокЗначений;
	
	Добавлять = Истина;
	Для Каждого ЭлСписка Из СписокВыбора Цикл
		Для Каждого Показатель Из СписокОтчетовПользователя Цикл
			Если ЭлСписка.Значение = Показатель.Значение Тогда
				Добавлять = Ложь;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		Если Добавлять Тогда
			СписокВыборкаДляПользователя.Добавить(ЭлСписка.Значение);
			
			Продолжить;
		КонецЕсли;
		
		Добавлять = Истина;
	КонецЦикла;
	
	Если СписокВыборкаДляПользователя.Количество() = 0 Тогда
		Сообщить("Все отчеты добавлены!");
	Иначе
		Результат = ПоказатьФормуВыбора(СписокВыборкаДляПользователя);
		
		Ответ = ДобавитьОтчетНаСервере(Результат);
		
		Если ЗначениеЗаполнено(Ответ) Тогда
			
			ПоказатьПредупреждение(, Ответ);
		Иначе
			Если ЗначениеЗаполнено(Результат) Тогда
				Если ТипЗнч(СписокОтчетовПользователя) = Тип("СписокЗначений") Тогда
					СписокОтчетовПользователя.Добавить(Результат);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьОтчетНаСервере(ИмяОтчета)
	Перем Ответ; 
		
	Если ЗначениеЗаполнено(ИмяОтчета) Тогда
		ГруппаОтчетов = Элементы.ГруппаОтчеты;
		Эталон = Элементы.КнопкаЭталон;
		
		Если ИмяОтчета = "Исполнители" ИЛИ
			ИмяОтчета = "Эффективность цеха" ИЛИ
			ИмяОтчета = "Учет нерабочего времени" ИЛИ 
			ИмяОтчета = "Учет времени" ИЛИ
			ИмяОтчета = "Прочая занятость" ИЛИ
			ИмяОтчета = "Отчет по среднему чеку" ИЛИ
			ИмяОтчета = "Отчет по сертификатам контроля" ИЛИ
			ИмяОтчета = "Отчет по заездам" ИЛИ
			ИмяОтчета = "Конверсия обращений" ИЛИ
			ИмяОтчета = "Использование DMS" ИЛИ
			ИмяОтчета = "ТО" ИЛИ 
			ИмяОтчета = "Анализ первичных заездов" Тогда
			
			ИмяЭлемента = СтрокаВВерблюжьейНотации(ИмяОтчета);
			Ответ = СоздатьКнопкуОтчета(ИмяОтчета, ИмяЭлемента, ГруппаОтчетов, Эталон); 			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ; 	
КонецФункции

&НаСервере
Функция СоздатьКнопкуОтчета(ИмяОтчета, ИмяЭлемента, ГруппаОтчетов, Эталон)
	Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда			
		Возврат "Такой отчет уже есть"; 			
	КонецЕсли;
	
	КФОткрытьОтчет = ЭтаФорма.Команды.Найти( ИмяЭлемента);

	Если КФОткрытьОтчет = Неопределено Тогда			
		КФОткрытьОтчет = ЭтаФорма.Команды.Добавить(ИмяЭлемента);
		КФОткрытьОтчет.Действие = "ОткрытьОтчет";			
	КонецЕсли;
	
	ДобавитьКПанПоказателяИлиОтчета(ГруппаОтчетов, ИмяЭлемента); 
				
	НовыйОтчет = Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), ГруппаОтчетов);
	НовыйОтчет.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	ЗаполнитьЗначенияСвойств(НовыйОтчет, Эталон, , "Родитель, Видимость, ИмяКоманды, Заголовок, Имя");
	
	НовыйОтчет.Заголовок = ИмяОтчета;
	НовыйОтчет.ИмяКоманды = ИмяЭлемента;	
КонецФункции

&НаСервереБезКонтекста
Функция СтрокаВВерблюжьейНотации(Знач Строка)
	Строка = СокрЛП(Строка);
	
	ДлинаСтроки = СтрДлина(Строка);
	
	ПеревестиВВерхнийРегистр = Истина;
	НоваяСтрока = "";
	
	Для Счетчик = 1 По ДлинаСтроки Цикл
		СимволСтроки = Сред(Строка, Счетчик, 1);
		
		Если ПеревестиВВерхнийРегистр Тогда
			СимволСтроки = ВРег(СимволСтроки);
			ПеревестиВВерхнийРегистр = Ложь;			
		КонецЕсли;		
		
		Если СимволСтроки = " " Тогда
			ПеревестиВВерхнийРегистр = Истина;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НоваяСтрока + СимволСтроки;		
	КонецЦикла;
	
	Возврат НоваяСтрока;	
КонецФункции	 

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаБезВерблюжьейНотации(Знач Строка)
	Строка = СокрЛП(Строка);
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Пробел = " ";	
	НоваяСтрока = "";
	ПредыдущийСимвол = "";
	
	Для Счетчик = 1 По ДлинаСтроки Цикл
		СимволСтроки = Сред(Строка, Счетчик, 1);
		
		Если СимволСтроки = ВРег(СимволСтроки) И НЕ Счетчик = 1 Тогда
			Если ПредыдущийСимвол <> ВРег(ПредыдущийСимвол) Тогда
				НоваяСтрока = НоваяСтрока + Пробел + НРег(СимволСтроки);
			Иначе
				НоваяСтрока = Лев(НоваяСтрока, СтрДлина(НоваяСтрока) - 1) + ПредыдущийСимвол;
				НоваяСтрока = НоваяСтрока + СимволСтроки;
			КонецЕсли;
		Иначе
			НоваяСтрока = НоваяСтрока + СимволСтроки;
		КонецЕсли;
		
		ПредыдущийСимвол = СимволСтроки;
	КонецЦикла;
	
	Возврат НоваяСтрока;	
КонецФункции

&НаСервере
Процедура ОпределитьПоказательСреднийЧекПоВидамРемонта(ИмяРеквизита)
	Диаграмма = ЭтаФорма[ИмяРеквизита];					
	
	Если Диаграмма = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Диаграмма.ОбластьПостроения.ОтображатьТаблицуДанных = Истина;
	Диаграмма.Очистить();
	
	ТекущаяДата = ТекущаяДата();
	НачалоМесяца = НачалоМесяца(ТекущаяДата);
	КонецМесяца = КонецМесяца(ТекущаяДата);
	НачалоГода = НачалоГода(ТекущаяДата);
	КонецГода = КонецГода(ТекущаяДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|				ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).Ссылка
		|		КОНЕЦ) КАК КоличествоЧеков,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ КАК ВидРемонта
		|ПОМЕСТИТЬ ПродажиОсновныеДанныеМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|				ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).Ссылка
		|		КОНЕЦ) КАК КоличествоЧеков,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ КАК ВидРемонта
		|ПОМЕСТИТЬ ПродажиОсновныеДанныеГод
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоГода, &КонецГода, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОсновныеДанныеМесяц.ВидРемонта,
		|	ВЫРАЗИТЬ(ПродажиОсновныеДанныеМесяц.Сумма / ПродажиОсновныеДанныеМесяц.КоличествоЧеков КАК ЧИСЛО(15, 2)) КАК СуммаСреднегоЧекаЗаМесяц
		|ПОМЕСТИТЬ СреднийЧекМесяц
		|ИЗ
		|	ПродажиОсновныеДанныеМесяц КАК ПродажиОсновныеДанныеМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОсновныеДанныеГод.ВидРемонта,
		|	ВЫРАЗИТЬ(ПродажиОсновныеДанныеГод.Сумма / ПродажиОсновныеДанныеГод.КоличествоЧеков КАК ЧИСЛО(15, 2)) КАК СуммаСреднегоЧекаЗаГод
		|ПОМЕСТИТЬ СреднийЧекГод
		|ИЗ
		|	ПродажиОсновныеДанныеГод КАК ПродажиОсновныеДанныеГод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(СреднийЧекГод.ВидРемонта) КАК ВидРемонтаПредставление,
		|	СреднийЧекГод.СуммаСреднегоЧекаЗаГод,
		|	ЕСТЬNULL(СреднийЧекМесяц.СуммаСреднегоЧекаЗаМесяц, 0) КАК СуммаСреднегоЧекаЗаМесяц
		|ИЗ
		|	СреднийЧекГод КАК СреднийЧекГод
		|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийЧекМесяц КАК СреднийЧекМесяц
		|		ПО СреднийЧекГод.ВидРемонта = СреднийЧекМесяц.ВидРемонта"; 	
	Запрос.УстановитьПараметр("КонецГода", КонецГода);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца); 	
	Результат = Запрос.Выполнить();	
		
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		
		СерияГод = Диаграмма.Серии.Добавить(Строка("Средний чек за год"));
		СерияМесяц = Диаграмма.Серии.Добавить(Строка("Средний чек за месяц"));

		Пока Выборка.Следующий() Цикл
			ВидРемонтаПредставление = Выборка.ВидРемонтаПредставление;
			СуммаСреднегоЧекаЗаГод = Выборка.СуммаСреднегоЧекаЗаГод;
			СуммаСреднегоЧекаЗаМесяц = Выборка.СуммаСреднегоЧекаЗаМесяц;			
				
			НоваяТочка = Диаграмма.Точки.Добавить(ВидРемонтаПредставление);
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияГод, СуммаСреднегоЧекаЗаГод); 			
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияМесяц, СуммаСреднегоЧекаЗаМесяц);
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОпределитьПоказательСреднееКоличествоНормочасовЗаЗаездПоВидамРемонта(ИмяРеквизита)
	Диаграмма = ЭтаФорма[ИмяРеквизита];
	
	Если Диаграмма = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Диаграмма.ОбластьПостроения.ОтображатьТаблицуДанных = Истина;
	Диаграмма.Очистить();
	
	ТекущаяДата = ТекущаяДата();
	НачалоМесяца = НачалоМесяца(ТекущаяДата);
	КонецМесяца = КонецМесяца(ТекущаяДата);
	НачалоГода = НачалоГода(ТекущаяДата);
	КонецГода = КонецГода(ТекущаяДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|				ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).Ссылка
		|		КОНЕЦ) КАК КоличествоЧеков,
		|	СУММА(ПродажиОбороты.КоличествоНормочасовОборот) КАК КоличествоНормочасов,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ КАК ВидРемонта
		|ПОМЕСТИТЬ ПродажиОсновныеДанныеМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|				ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).Ссылка
		|		КОНЕЦ) КАК КоличествоЧеков,
		|	СУММА(ПродажиОбороты.КоличествоНормочасовОборот) КАК КоличествоНормочасов,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ КАК ВидРемонта
		|ПОМЕСТИТЬ ПродажиОсновныеДанныеГод
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоГода, &КонецГода, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОсновныеДанныеМесяц.ВидРемонта,
		|	ВЫРАЗИТЬ(ПродажиОсновныеДанныеМесяц.КоличествоНормочасов / ПродажиОсновныеДанныеМесяц.КоличествоЧеков КАК ЧИСЛО(15, 2)) КАК СреднейНормочасЗаМесяц
		|ПОМЕСТИТЬ НормоЧасМесяц
		|ИЗ
		|	ПродажиОсновныеДанныеМесяц КАК ПродажиОсновныеДанныеМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОсновныеДанныеГод.ВидРемонта,
		|	ВЫРАЗИТЬ(ПродажиОсновныеДанныеГод.КоличествоНормочасов / ПродажиОсновныеДанныеГод.КоличествоЧеков КАК ЧИСЛО(15, 2)) КАК СреднейНормочасЗаГод
		|ПОМЕСТИТЬ НормоЧасГод
		|ИЗ
		|	ПродажиОсновныеДанныеГод КАК ПродажиОсновныеДанныеГод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(НормоЧасГод.ВидРемонта) КАК ВидРемонтаПредставление,
		|	НормоЧасГод.СреднейНормочасЗаГод,
		|	ЕСТЬNULL(НормоЧасМесяц.СреднейНормочасЗаМесяц, 0) КАК СреднейНормочасЗаМесяц
		|ИЗ
		|	НормоЧасГод КАК НормоЧасГод
		|		ЛЕВОЕ СОЕДИНЕНИЕ НормоЧасМесяц КАК НормоЧасМесяц
		|		ПО НормоЧасГод.ВидРемонта = НормоЧасМесяц.ВидРемонта"; 	
	Запрос.УстановитьПараметр("КонецГода", КонецГода);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца); 	
	Результат = Запрос.Выполнить();	
		
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		
		СерияГод = Диаграмма.Серии.Добавить(Строка("Нормочасы за заезд (год)"));
		СерияМесяц = Диаграмма.Серии.Добавить(Строка("Нормочасы за заезд (месяц)"));

		Пока Выборка.Следующий() Цикл
			ВидРемонтаПредставление = Выборка.ВидРемонтаПредставление;
			СреднейНормочасЗаГод = Выборка.СреднейНормочасЗаГод;
			СреднейНормочасЗаМесяц = Выборка.СреднейНормочасЗаМесяц;			
				
			НоваяТочка = Диаграмма.Точки.Добавить(ВидРемонтаПредставление);
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияГод, СреднейНормочасЗаГод); 			
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияМесяц, СреднейНормочасЗаМесяц);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПоказательСуммаЗапчастейПоВидамРемонта(ИмяРеквизита)
	Диаграмма = ЭтаФорма[ИмяРеквизита];
	
	Если Диаграмма = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Диаграмма.ОбластьПостроения.ОтображатьТаблицуДанных = Истина;
	Диаграмма.Очистить();
	
	ТекущаяДата = ТекущаяДата();
	НачалоМесяца = НачалоМесяца(ТекущаяДата);
	КонецМесяца = КонецМесяца(ТекущаяДата);
	НачалоГода = НачалоГода(ТекущаяДата);
	КонецГода = КонецГода(ТекущаяДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ КАК ВидРемонта
		|ПОМЕСТИТЬ ПродажиТоваровДанныеМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|	И ПродажиОбороты.Авторабота = ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ КАК ВидРемонта
		|ПОМЕСТИТЬ ПродажиТоваровДанныеГод
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоГода, &КонецГода, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|	И ПродажиОбороты.Авторабота = ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ПродажиТоваровДанныеГод.ВидРемонта) КАК ВидРемонтаПредставление,
		|	ПродажиТоваровДанныеГод.Сумма КАК СуммаПроданныхТоваровГод,
		|	ЕСТЬNULL(ПродажиТоваровДанныеМесяц.Сумма, 0) КАК СуммаПроданныхТоваровМесяц
		|ИЗ
		|	ПродажиТоваровДанныеГод КАК ПродажиТоваровДанныеГод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиТоваровДанныеМесяц КАК ПродажиТоваровДанныеМесяц
		|		ПО (ПродажиТоваровДанныеМесяц.ВидРемонта = ПродажиТоваровДанныеГод.ВидРемонта)";  	
	Запрос.УстановитьПараметр("КонецГода", КонецГода);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца); 	
	Результат = Запрос.Выполнить();	
		
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		
		СерияГод = Диаграмма.Серии.Добавить(Строка("Сумма проданных товаров (год)"));
		СерияМесяц = Диаграмма.Серии.Добавить(Строка("Сумма проданных товаров (месяц)"));

		Пока Выборка.Следующий() Цикл
			ВидРемонтаПредставление = Выборка.ВидРемонтаПредставление;
			СуммаПроданныхТоваровГод = Выборка.СуммаПроданныхТоваровГод;
			СуммаПроданныхТоваровМесяц = Выборка.СуммаПроданныхТоваровМесяц;			
				
			НоваяТочка = Диаграмма.Точки.Добавить(ВидРемонтаПредставление);
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияГод, СуммаПроданныхТоваровГод); 			
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияМесяц, СуммаПроданныхТоваровМесяц);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПоказательКоличествоЗаездов(ИмяРеквизита)
	Диаграмма = ЭтаФорма[ИмяРеквизита];					
	
	Если Диаграмма = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Диаграмма.ОбластьПостроения.ОтображатьТаблицуДанных = Истина;
	Диаграмма.Очистить();
	
	ТекущаяДата = ТекущаяДата();
	НачалоМесяца = НачалоМесяца(ТекущаяДата);
	КонецМесяца = КонецМесяца(ТекущаяДата);
	НачалоГода = НачалоГода(ТекущаяДата);
	КонецГода = КонецГода(ТекущаяДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|				ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).Ссылка
		|		КОНЕЦ) КАК КоличествоЗаездовВМесяц
		|ПОМЕСТИТЬ ПродажиОсновныеДанныеМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|				ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.ЗаказНаряд).Ссылка
		|		КОНЕЦ) КАК КоличествоЗаездовВГод
		|ПОМЕСТИТЬ ПродажиОсновныеДанныеГод
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоГода, &КонецГода, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОсновныеДанныеГод.КоличествоЗаездовВГод,
		|	ЕСТЬNULL(ПродажиОсновныеДанныеМесяц.КоличествоЗаездовВМесяц, 0) КАК КоличествоЗаездовВМесяц
		|ИЗ
		|	ПродажиОсновныеДанныеМесяц КАК ПродажиОсновныеДанныеМесяц
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПродажиОсновныеДанныеГод КАК ПродажиОсновныеДанныеГод
		|		ПО (ИСТИНА)"; 	
	Запрос.УстановитьПараметр("КонецГода", КонецГода);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца); 	
	Результат = Запрос.Выполнить();	
		
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		
		СерияГод = Диаграмма.Серии.Добавить(Строка("Количество заездов за год"));
		СерияМесяц = Диаграмма.Серии.Добавить(Строка("Количество заездов за месяц"));

		Пока Выборка.Следующий() Цикл
			КоличествоЗаездовВГод = Выборка.КоличествоЗаездовВГод;
			КоличествоЗаездовВМесяц = Выборка.КоличествоЗаездовВМесяц;			
				
			НоваяТочка = Диаграмма.Точки.Добавить("Показатель");
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияГод, КоличествоЗаездовВГод); 			
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияМесяц, КоличествоЗаездовВМесяц);
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОпределитьПоказательКоличествоНормочасов(ИмяРеквизита)
	Диаграмма = ЭтаФорма[ИмяРеквизита];
	
	Если Диаграмма = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Диаграмма.ОбластьПостроения.ОтображатьТаблицуДанных = Истина;
	Диаграмма.Очистить();
	
	ТекущаяДата = ТекущаяДата();
	НачалоМесяца = НачалоМесяца(ТекущаяДата);
	КонецМесяца = КонецМесяца(ТекущаяДата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.КоличествоНормочасовОборот) КАК КоличествоНормочасов
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд"; 	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Результат = Запрос.Выполнить();	
		
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		
		СерияМесяц = Диаграмма.Серии.Добавить(Строка("Количество нормочасов (месяц)"));

		Пока Выборка.Следующий() Цикл
			КоличествоНормочасов = Выборка.КоличествоНормочасов;
				
			НоваяТочка = Диаграмма.Точки.Добавить("Показатель");
			Диаграмма.УстановитьЗначение(НоваяТочка, СерияМесяц, КоличествоНормочасов);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Renault_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РабочийСтолРуководителя_СписокОтчетовПользователя",,СписокОтчетовПользователя);
	Renault_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РабочийСтолРуководителя_СписокПоказателейПользователя",,СписокПоказателейПользователя);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоказатели(Команда)
	ОчиститьПоказателиСервер();
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоказателиСервер()
	СписокПоказателей = Новый Массив;
	
	Для Каждого Эл Из СписокПоказателейПользователя Цикл
		СписокПоказателей.Добавить(Эл.Значение);	
	КонецЦикла;
	
	Для Каждого Показатель Из СписокПоказателей Цикл
		УдалитьОтчетИлиПоказатель(СтрокаВВерблюжьейНотации(Показатель));
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчеты(Команда)
	ОчиститьОтчетыСервер();	
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтчетыСервер()
	СписокОтчетов = Новый Массив;
	
	Для Каждого Эл Из СписокОтчетовПользователя Цикл
		СписокОтчетов.Добавить(Эл.Значение);	
	КонецЦикла;
	
	Для Каждого ОтчетИмя Из СписокОтчетов Цикл
		УдалитьОтчетИлиПоказатель(СтрокаВВерблюжьейНотации(ОтчетИмя));
	КонецЦикла;	
КонецПроцедуры 

&НаКлиенте
Процедура НазначитьЗадачи(Команда)
	ОткрытьФорму("Обработка.Renault_АРМПоНазначениюЗадач.Форма.Форма");
КонецПроцедуры

СписокДнейНеделиСокр = Новый СписокЗначений;
СписокДнейНеделиСокр.Добавить("Пн");
СписокДнейНеделиСокр.Добавить("Вт");
СписокДнейНеделиСокр.Добавить("Ср");
СписокДнейНеделиСокр.Добавить("Чт");
СписокДнейНеделиСокр.Добавить("Пт");
СписокДнейНеделиСокр.Добавить("Сб");
СписокДнейНеделиСокр.Добавить("Вс");
